<?php

use Illuminate\Database\Seeder;

class ProductsTableSeeder extends Seeder
{

    /**
     * Auto generated seed file
     *
     * @return void
     */
    public function run()
    {
        

        \DB::table('products')->delete();
        
        \DB::table('products')->insert(array (
            0 => 
            array (
                'id' => 1,
                'shelf_id' => 1,
                'characters' => '充50得55，多充多送，优惠多多',
                'content' => '充50得55，多充多送，优惠多多',
                'price' => '50.00',
                'is_default' => 0,
                'sales' => 6,
                'points' => 10,
                'status' => 1,
                'created_at' => NULL,
                'updated_at' => '2017-11-07 19:07:14',
            ),
            1 => 
            array (
                'id' => 2,
                'shelf_id' => 2,
                'characters' => '充100得200，多充多送，优惠多多',
                'content' => '充100得200，多充多送，优惠多多',
                'price' => '100.00',
                'is_default' => 0,
                'sales' => 0,
                'points' => 10,
                'status' => 1,
                'created_at' => NULL,
                'updated_at' => NULL,
            ),
            2 => 
            array (
                'id' => 3,
                'shelf_id' => 3,
                'characters' => '充200得400，多充多送，优惠多多',
                'content' => '充200得400，多充多送，优惠多多',
                'price' => '200.00',
                'is_default' => 0,
                'sales' => 0,
                'points' => 10,
                'status' => 1,
                'created_at' => NULL,
                'updated_at' => NULL,
            ),
            3 => 
            array (
                'id' => 4,
                'shelf_id' => 4,
                'characters' => '充300得600，多充多送，优惠多多',
                'content' => '充300得600，多充多送，优惠多多',
                'price' => '300.00',
                'is_default' => 0,
                'sales' => 0,
                'points' => 10,
                'status' => 1,
                'created_at' => NULL,
                'updated_at' => NULL,
            ),
            4 => 
            array (
                'id' => 5,
                'shelf_id' => 5,
                'characters' => '充400得800，多充多送，优惠多多',
                'content' => '充400得800，多充多送，优惠多多',
                'price' => '400.00',
                'is_default' => 0,
                'sales' => 0,
                'points' => 10,
                'status' => 1,
                'created_at' => NULL,
                'updated_at' => NULL,
            ),
            5 => 
            array (
                'id' => 6,
                'shelf_id' => 6,
                'characters' => '充500得1000，多充多送，优惠多多',
                'content' => '充500得1000，多充多送，优惠多多',
                'price' => '500.00',
                'is_default' => 0,
                'sales' => 0,
                'points' => 10,
                'status' => 1,
                'created_at' => NULL,
                'updated_at' => NULL,
            ),
            6 => 
            array (
                'id' => 7,
                'shelf_id' => 7,
                'characters' => '19L',
                'content' => '订农夫山泉桶装水与家人共同分享天然弱碱性水的健康与品质！',
                'price' => '22.00',
                'is_default' => 1,
                'sales' => 90,
                'points' => 10,
                'status' => 1,
                'created_at' => NULL,
                'updated_at' => '2017-11-07 19:34:51',
            ),
            7 => 
            array (
                'id' => 8,
                'shelf_id' => 8,
                'characters' => '17L',
                'content' => '唐代宫廷御贡金沙泉，点滴沉睡千百年，健康之水金沙泉！',
                'price' => '15.00',
                'is_default' => 1,
                'sales' => 50,
                'points' => 10,
                'status' => 1,
                'created_at' => NULL,
                'updated_at' => '2017-11-07 19:37:09',
            ),
            8 => 
            array (
                'id' => 9,
                'shelf_id' => 9,
                'characters' => '2L',
                'content' => '一箱8瓶，水源地杭州千岛湖',
                'price' => '35.00',
                'is_default' => 1,
                'sales' => 20,
                'points' => 10,
                'status' => 1,
                'created_at' => NULL,
                'updated_at' => '2017-11-07 19:37:09',
            ),
            9 => 
            array (
                'id' => 10,
                'shelf_id' => 9,
                'characters' => '4L',
                'content' => '一箱4瓶，水源地杭州千岛湖，天然弱碱性水！',
                'price' => '38.00',
                'is_default' => 1,
                'sales' => 10,
                'points' => 10,
                'status' => 1,
                'created_at' => NULL,
                'updated_at' => '2017-11-07 19:37:09',
            ),
            10 => 
            array (
                'id' => 11,
                'shelf_id' => 9,
                'characters' => '5L',
                'content' => '一箱4瓶，水源地杭州千岛湖，天然弱碱性水！',
                'price' => '40.00',
                'is_default' => 1,
                'sales' => 7,
                'points' => 10,
                'status' => 1,
                'created_at' => NULL,
                'updated_at' => '2017-11-07 19:30:39',
            ),
            11 => 
            array (
                'id' => 12,
                'shelf_id' => 11,
                'characters' => '1箱',
                'content' => '卖家服务
京东承诺
京东平台卖家销售并发货的商品，由平台卖家提供发票和相应的售后服务。请您放心购买！
注：因厂家会在没有任何提前通知的情况下更改产品包装、产地或者一些附件，本司不能确保客户收到的货物与商城图片、产地、附件说明完全一致。只能确保为原厂正货！并且保证与当时市场上同样主流新品一致。若本商城没有及时更新，请大家谅解！
正品行货
京东商城向您保证所售商品均为正品行货，京东自营商品开具机打发票或电子发票。
全国联保
凭质保证书及京东商城发票，可享受全国联保服务（奢侈品、钟表除外；奢侈品、钟表由京东联系保修，享受法定三包售后服务），与您亲临商场选购的商品享受相同的质量保证。京东商城还为您提供具有竞争力的商品价格和运费政策，请您放心购买！ 

注：因厂家会在没有任何提前通知的情况下更改产品包装、产地或者一些附件，本司不能确保客户收到的货物与商城图片、产地、附件说明完全一致。只能确保为原厂正货！并且保证与当时市场上同样主流新品一致。若本商城没有及时更新，请大家谅解！',
                'price' => '79.00',
                'is_default' => 1,
                'sales' => 123,
                'points' => 20,
                'status' => 1,
                'created_at' => '2017-11-08 11:28:50',
                'updated_at' => '2017-11-08 11:28:50',
            ),
            12 => 
            array (
                'id' => 13,
                'shelf_id' => 11,
                'characters' => '2件',
                'content' => '卖家服务
京东承诺
京东平台卖家销售并发货的商品，由平台卖家提供发票和相应的售后服务。请您放心购买！
注：因厂家会在没有任何提前通知的情况下更改产品包装、产地或者一些附件，本司不能确保客户收到的货物与商城图片、产地、附件说明完全一致。只能确保为原厂正货！并且保证与当时市场上同样主流新品一致。若本商城没有及时更新，请大家谅解！
正品行货
京东商城向您保证所售商品均为正品行货，京东自营商品开具机打发票或电子发票。
全国联保
凭质保证书及京东商城发票，可享受全国联保服务（奢侈品、钟表除外；奢侈品、钟表由京东联系保修，享受法定三包售后服务），与您亲临商场选购的商品享受相同的质量保证。京东商城还为您提供具有竞争力的商品价格和运费政策，请您放心购买！ 

注：因厂家会在没有任何提前通知的情况下更改产品包装、产地或者一些附件，本司不能确保客户收到的货物与商城图片、产地、附件说明完全一致。只能确保为原厂正货！并且保证与当时市场上同样主流新品一致。若本商城没有及时更新，请大家谅解！',
                'price' => '155.00',
                'is_default' => 1,
                'sales' => 0,
                'points' => 50,
                'status' => 1,
                'created_at' => '2017-11-08 11:29:55',
                'updated_at' => '2017-11-08 11:29:55',
            ),
            13 => 
            array (
                'id' => 14,
                'shelf_id' => 12,
                'characters' => '1件',
                'content' => '卖家服务
京东承诺
京东平台卖家销售并发货的商品，由平台卖家提供发票和相应的售后服务。请您放心购买！
注：因厂家会在没有任何提前通知的情况下更改产品包装、产地或者一些附件，本司不能确保客户收到的货物与商城图片、产地、附件说明完全一致。只能确保为原厂正货！并且保证与当时市场上同样主流新品一致。若本商城没有及时更新，请大家谅解！
正品行货
京东商城向您保证所售商品均为正品行货，京东自营商品开具机打发票或电子发票。
全国联保
凭质保证书及京东商城发票，可享受全国联保服务（奢侈品、钟表除外；奢侈品、钟表由京东联系保修，享受法定三包售后服务），与您亲临商场选购的商品享受相同的质量保证。京东商城还为您提供具有竞争力的商品价格和运费政策，请您放心购买！ 

注：因厂家会在没有任何提前通知的情况下更改产品包装、产地或者一些附件，本司不能确保客户收到的货物与商城图片、产地、附件说明完全一致。只能确保为原厂正货！并且保证与当时市场上同样主流新品一致。若本商城没有及时更新，请大家谅解！',
                'price' => '784.00',
                'is_default' => 1,
                'sales' => 0,
                'points' => 100,
                'status' => 1,
                'created_at' => '2017-11-08 11:35:29',
                'updated_at' => '2017-11-08 11:35:29',
            ),
            14 => 
            array (
                'id' => 15,
                'shelf_id' => 12,
                'characters' => '团购2件',
                'content' => '卖家服务
京东承诺
京东平台卖家销售并发货的商品，由平台卖家提供发票和相应的售后服务。请您放心购买！
注：因厂家会在没有任何提前通知的情况下更改产品包装、产地或者一些附件，本司不能确保客户收到的货物与商城图片、产地、附件说明完全一致。只能确保为原厂正货！并且保证与当时市场上同样主流新品一致。若本商城没有及时更新，请大家谅解！
正品行货
京东商城向您保证所售商品均为正品行货，京东自营商品开具机打发票或电子发票。
全国联保
凭质保证书及京东商城发票，可享受全国联保服务（奢侈品、钟表除外；奢侈品、钟表由京东联系保修，享受法定三包售后服务），与您亲临商场选购的商品享受相同的质量保证。京东商城还为您提供具有竞争力的商品价格和运费政策，请您放心购买！ 

注：因厂家会在没有任何提前通知的情况下更改产品包装、产地或者一些附件，本司不能确保客户收到的货物与商城图片、产地、附件说明完全一致。只能确保为原厂正货！并且保证与当时市场上同样主流新品一致。若本商城没有及时更新，请大家谅解！',
                'price' => '1400.00',
                'is_default' => 1,
                'sales' => 0,
                'points' => 100,
                'status' => 1,
                'created_at' => '2017-11-08 11:36:17',
                'updated_at' => '2017-11-08 11:44:28',
            ),
            15 => 
            array (
                'id' => 16,
                'shelf_id' => 13,
                'characters' => '1件',
                'content' => '卖家服务
京东承诺
京东平台卖家销售并发货的商品，由平台卖家提供发票和相应的售后服务。请您放心购买！
注：因厂家会在没有任何提前通知的情况下更改产品包装、产地或者一些附件，本司不能确保客户收到的货物与商城图片、产地、附件说明完全一致。只能确保为原厂正货！并且保证与当时市场上同样主流新品一致。若本商城没有及时更新，请大家谅解！
正品行货
京东商城向您保证所售商品均为正品行货，京东自营商品开具机打发票或电子发票。
全国联保
凭质保证书及京东商城发票，可享受全国联保服务（奢侈品、钟表除外；奢侈品、钟表由京东联系保修，享受法定三包售后服务），与您亲临商场选购的商品享受相同的质量保证。京东商城还为您提供具有竞争力的商品价格和运费政策，请您放心购买！ 

注：因厂家会在没有任何提前通知的情况下更改产品包装、产地或者一些附件，本司不能确保客户收到的货物与商城图片、产地、附件说明完全一致。只能确保为原厂正货！并且保证与当时市场上同样主流新品一致。若本商城没有及时更新，请大家谅解！',
                'price' => '499.00',
                'is_default' => 0,
                'sales' => 0,
                'points' => 0,
                'status' => 1,
                'created_at' => '2017-11-08 11:45:10',
                'updated_at' => '2017-11-08 11:45:10',
            ),
            16 => 
            array (
                'id' => 17,
                'shelf_id' => 14,
                'characters' => '1件',
                'content' => '卖家服务
京东承诺
京东平台卖家销售并发货的商品，由平台卖家提供发票和相应的售后服务。请您放心购买！
注：因厂家会在没有任何提前通知的情况下更改产品包装、产地或者一些附件，本司不能确保客户收到的货物与商城图片、产地、附件说明完全一致。只能确保为原厂正货！并且保证与当时市场上同样主流新品一致。若本商城没有及时更新，请大家谅解！
正品行货
京东商城向您保证所售商品均为正品行货，京东自营商品开具机打发票或电子发票。
全国联保
凭质保证书及京东商城发票，可享受全国联保服务（奢侈品、钟表除外；奢侈品、钟表由京东联系保修，享受法定三包售后服务），与您亲临商场选购的商品享受相同的质量保证。京东商城还为您提供具有竞争力的商品价格和运费政策，请您放心购买！ 

注：因厂家会在没有任何提前通知的情况下更改产品包装、产地或者一些附件，本司不能确保客户收到的货物与商城图片、产地、附件说明完全一致。只能确保为原厂正货！并且保证与当时市场上同样主流新品一致。若本商城没有及时更新，请大家谅解！',
                'price' => '69.00',
                'is_default' => 0,
                'sales' => 0,
                'points' => 0,
                'status' => 1,
                'created_at' => '2017-11-08 11:45:48',
                'updated_at' => '2017-11-08 11:45:48',
            ),
            17 => 
            array (
                'id' => 18,
                'shelf_id' => 15,
                'characters' => '1件',
                'content' => '订水需提前预定，饿了么送达时间为系统内定时间只做参考，由于配送范围广覆盖全市，且送水比其他外卖相对困难相对辛苦费力费时。
为了您不断水，请预留一些水再提前预订！
咨询电话:2076662
客服QQ:389845060',
                'price' => '0.00',
                'is_default' => 0,
                'sales' => 0,
                'points' => 0,
                'status' => 1,
                'created_at' => '2017-11-08 11:51:12',
                'updated_at' => '2017-11-08 11:51:12',
            ),
            18 => 
            array (
                'id' => 19,
                'shelf_id' => 16,
                'characters' => '1件',
                'content' => '首次订桶装水没有桶需支付押金每个桶30元。押金为线下货到付款。
本店所有产品都是品牌专用桶只能同品牌的桶交换，杂牌水桶不能更换。
更卫生更安全！
如有疑问，欢迎来电咨询
电话：2076662
客服QQ:389845060',
                'price' => '0.00',
                'is_default' => 0,
                'sales' => 0,
                'points' => 0,
                'status' => 1,
                'created_at' => '2017-11-08 11:54:55',
                'updated_at' => '2017-11-08 11:54:55',
            ),
            19 => 
            array (
                'id' => 20,
                'shelf_id' => 17,
                'characters' => '1件',
                'content' => '单位客户可免费提供发票，提供饮水机，可支持购水票、月结、货到付款等付款方式。
可支持支付宝、微信支付、对公账户等支付方式、

订购桶装水一百张水票送饮水机一台。
订购袋装水一百张水票送专用饮水机一台。

电话：2076662
客服QQ:389845060
微信：15088058166',
                'price' => '0.00',
                'is_default' => 0,
                'sales' => 0,
                'points' => 0,
                'status' => 1,
                'created_at' => '2017-11-08 11:58:47',
                'updated_at' => '2017-11-08 11:58:47',
            ),
            20 => 
            array (
                'id' => 21,
                'shelf_id' => 18,
                'characters' => '1件',
                'content' => '天然矿泉水、矿物质水、天然水、纯净水的区别',
                'price' => '0.00',
                'is_default' => 0,
                'sales' => 0,
                'points' => 0,
                'status' => 1,
                'created_at' => '2017-11-08 11:59:39',
                'updated_at' => '2017-11-08 11:59:39',
            ),
        ));
        
        
    }
}